In [9]:
import pandas as pd

# Series

In [10]:
data = [1, 2 , 3, 4, 5]

In [11]:
s = pd.Series(data)

In [12]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
index = ['Linha' + str(i) for i in range(5)]

In [14]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [15]:
s = pd.Series(data = data, index = index)

In [16]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [17]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [18]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [19]:
s = pd.Series(data)

In [20]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [21]:
s1 = s + 2

In [22]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [23]:
s2 = s + s1

In [24]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrames

In [25]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [26]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [27]:
df1 = pd.DataFrame(data = data)

In [28]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [29]:
index = ['Linha' + str(i) for i in range(3)]

In [30]:
index

['Linha0', 'Linha1', 'Linha2']

In [31]:
def1 = pd.DataFrame(data = data, index = index)

In [32]:
def1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [33]:
columns = ['Coluna' + str(i) for i in range(3)]

In [34]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [35]:
df1 = pd.DataFrame(data = data, columns = columns)

In [36]:
df1

   Coluna0  Coluna1  Coluna2
0        1        2        3
1        4        5        6
2        7        8        9

In [37]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [38]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [39]:
df2 = pd.DataFrame(data)

In [40]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [41]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [42]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [43]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [44]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [45]:
df1[df1 > 0] = 'A'

In [46]:
df1

  Coluna0 Coluna1 Coluna2
0       A       A       A
1       A       A       A
2       A       A       A

In [47]:
df2[df2 > 0] = 'B'

In [48]:
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [49]:
df3[df3 > 0] = 'C'

In [50]:
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [51]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
0            A       A       A
1            A       A       A
2            A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [52]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
0            A       A       A     NaN     NaN     NaN     NaN     NaN     NaN
1            A       A       A     NaN     NaN     NaN     NaN     NaN     NaN
2            A       A       A     NaN     NaN     NaN     NaN     NaN     NaN
Linha0     NaN     NaN     NaN       B       B       B       C       C       C
Linha1     NaN     NaN     NaN       B       B       B       C       C       C
Linha2     NaN     NaN     NaN       B       B       B       C       C       C

In [54]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D